#![feature(prelude_import)]
extern crate std;
#[prelude_import]
use std::prelude::rust_2024::*;
pub mod autograd {
    pub mod impls {
        use std::{cell::RefCell, marker::PhantomData, rc::Rc};
        use crate::{
            autograd::graph::{GradSlot, GraphNode},
            common::{
                DType, Shape, Tensor, dtype::DTypeImpl, impls::Impl,
                tensor::TensorPrototype,
            },
        };
        pub struct Autograd<I: Impl, GI: DTypeImpl<I>> {
            _marker: PhantomData<I>,
            _marker2: PhantomData<GI>,
        }
        impl<I: Impl, GI: DTypeImpl<I>> Impl for Autograd<I, GI> {
            type Device = I::Device;
        }
        impl<I: Impl, TI: DTypeImpl<I>, GI: DTypeImpl<I>> DTypeImpl<Autograd<I, GI>>
        for TI {
            type Prototype = AutoGradPrototype<I, TI, GI>;
        }
        pub struct AutoGradPrototype<I: Impl, TI: DTypeImpl<I>, GI: DTypeImpl<I>> {
            tensor: Tensor<I, TI>,
            grad: Rc<RefCell<GradSlot<I, GI>>>,
            node: Option<GraphNode<I, TI, GI>>,
            output_nr: usize,
        }
        impl<
            I: Impl,
            TI: DTypeImpl<I>,
            GI: DTypeImpl<I>,
        > TensorPrototype<Autograd<I, GI>> for AutoGradPrototype<I, TI, GI> {
            fn shape(&self) -> Shape {
                self.tensor.shape()
            }
            fn dtype(&self) -> DType {
                self.tensor.dtype()
            }

                                    mem.as_mut_ptr() as *mut u8,
                                    mem.size() * size_of::<f32>(),
                                )
                            })
                        {
                            {
                                ::core::panicking::panic_fmt(
                                    format_args!(
                                        "Cannot create a tensor from raw data: {0}.",
                                        e,
                                    ),
                                );
                            };
                        }
                        CPUTensorAnyPrototype::from(
                            CPUTensorPrototype::new(
                                mem.into(),
                                &shape,
                                &create_contiguous_stride(&shape),
                                0,
                            ),
                        )
                    }
                    _ => {
                        ::core::panicking::panic_fmt(
                            format_args!("DType {0} is not supported.", data.dtype),
                        );
                    }
                }
            }
        }
    }
    pub mod interface {
        pub type DType = u8;
        #[repr(C)]
        pub struct CPUTensor {
            pub data: *mut u8,
            pub shape: *const usize,
            pub stride: *const usize,
            pub dims: usize,
            pub dtype: DType,
        }
        #[automatically_derived]
        impl ::core::fmt::Debug for CPUTensor {
            #[inline]
            fn fmt(&self, f: &mut ::core::fmt::Formatter) -> ::core::fmt::Result {
                ::core::fmt::Formatter::debug_struct_field5_finish(
                    f,
                    "CPUTensor",
                    "data",
                    &self.data,
                    "shape",
                    &self.shape,
                    "stride",
                    &self.stride,
                    "dims",
                    &self.dims,
                    "dtype",
                    &&self.dtype,
                )
            }
        }
        #[automatically_derived]
        impl ::core::marker::Copy for CPUTensor {}
        #[automatically_derived]
        #[doc(hidden)]
        unsafe impl ::core::clone::TrivialClone for CPUTensor {}
        #[automatically_derived]
        impl ::core::clone::Clone for CPUTensor {
            #[inline]
            fn clone(&self) -> CPUTensor {
                let _: ::core::clone::AssertParamIsClone<*mut u8>;
                let _: ::core::clone::AssertParamIsClone<*const usize>;
                let _: ::core::clone::AssertParamIsClone<*const usize>;
                let _: ::core::clone::AssertParamIsClone<usize>;
                let _: ::core::clone::AssertParamIsClone<DType>;
                *self
            }
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of CPUTensor"][::std::mem::size_of::<CPUTensor>() - 40usize];
            ["Alignment of CPUTensor"][::std::mem::align_of::<CPUTensor>() - 8usize];
            [
                "Offset of field: CPUTensor::data",
            ][const { builtin # offset_of(CPUTensor, data) } - 0usize];
            [
                "Offset of field: CPUTensor::shape",
            ][const { builtin # offset_of(CPUTensor, shape) } - 8usize];
            [
                "Offset of field: CPUTensor::stride",
            ][const { builtin # offset_of(CPUTensor, stride) } - 16usize];
            [
                "Offset of field: CPUTensor::dims",
            ][const { builtin # offset_of(CPUTensor, dims) } - 24usize];
            [
                "Offset of field: CPUTensor::dtype",
            ][const { builtin # offset_of(CPUTensor, dtype) } - 32usize];
        };
        unsafe extern "C" {
            pub fn cpu_tensor_cast(out: CPUTensor, lhs: CPUTensor);
        }
        unsafe extern "C" {
            pub fn cpu_tensor_copy(dst: CPUTensor, src: CPUTensor);
        }
        unsafe extern "C" {
            pub fn cpu_tensor_add(out: CPUTensor, lhs: CPUTensor, rhs: CPUTensor);
        }
        /// A trait for converting a CPU tensor prototype into the CPUTensor interface used by the CPU operations. This is necessary because the CPU operations are implemented in C and expect a specific interface for the tensor data.
        pub trait IntoInterface {
            unsafe fn into_interface(&self) -> CPUTensor;
        }
    }
    pub mod mem {
        use std::cell::RefCell;
        use std::rc::Rc;
        /// Tensor's representation in CPU memory.
        pub struct CPUMemory<T> {
            ptr: *mut T,
